# Пользователь вводит предложение, заменить все пробелы на "-" 2-мя способами:
#
# ЗАПРОС ТЕКСТА -----------------------------------------
initial_text = input("Введите любой текст: ")
# СПОСОБ 1-----------------------------------------------
final_text_1 = initial_text.replace(" ", "-")
# СПОСОБ 2-----------------------------------------------
initial_text_list = initial_text.split(" ")
final_text_2 = "-".join(initial_text_list)
# ВЫВОД РЕЗУЛЬТАТОВ--------------------------------------
print(final_text_1)
print(final_text_2)
